
//Задача 19. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
/*
Console.Write("Просьба введите пятизначное число: ");
int num = Convert.ToInt32(Console.ReadLine());

string str = num.ToString();

if (str[0]==str[4] && str[1]==str[3]) Console.WriteLine("Данное число является полиндромом");
else Console.WriteLine("Данное число не является полиндромом");
*/



